title: Potential Credential Dumping

id: 44444444-4444-4444-4444-444444444444

logsource:
  product: windows
  category: process_creation

detection:
  selection:
    CommandLine|contains:
      - "mimikatz"
      - "sekurlsa"
      - "lsass"

condition: selection

level: critical

tags:
  - attack.credential_access
  - attack.t1003