title: Encoded PowerShell Execution

id: 11111111-1111-1111-1111-111111111111

status: experimental

description: Detects encoded PowerShell execution

logsource:
  product: windows
  category: process_creation

detection:
  selection:
    CommandLine|contains:
      - "-enc"
      - "-encodedcommand"

condition: selection

level: high

tags:
  - attack.execution
  - attack.t1059.001