title: Suspicious Rundll32 Usage

id: 55555555-5555-5555-5555-555555555555

logsource:
  product: windows
  category: process_creation

detection:
  selection:
    Image|endswith:
      - '\rundll32.exe'

condition: selection

level: medium

tags:
  - attack.defense_evasion
  - attack.t1218